---
layout: post
title:  "Hello world"
date:   2014-08-24 15:57:32
categories: Say hello
---

搭建了这样一个写博客的平台，对于一个非技术宅来说真的有太多的不容易了，总算看到了一些像模像样的成果，真的想大声地对世界说一声：“Hello world!”真有点小开心，小激动呢。

参考了[github]上面很多人的博客，一时还没有全部注明出处，因为太乱太杂了，稍后会补充上去。如果还未及时注明的请及时[Email]告诉我！

这个博客打算用来分享一些我经历过的东西，作为一个非技术宅，分享一些菜鸟的所见所闻。当然不一定都是技术或者学习的，吃喝玩乐的我觉得有意思的东西，也许我也会PO上来。

刚刚搭建起来的博客，用的是[jekyll]的框架。里面的各种部件和设计比较多还是参考[jekyll]以及它给出的一些模版，有一些则因为自己有一些想法，然后就去[github]上面找了有相似的实现，配合自己的想法改了改。代码在[github]上面都有，如果大家喜欢我博客的这种样式，尽管拿去用，

还有很多东西要补充进去，例如站内搜索，例如评论区，例如……我又学到什么意思的东西如果用得上没准就会拿来用。欢迎大家交流！

谢谢大家！

[Email]:  mailto:sysu.zhuang@gamil.com
[jekyll]: http://jekyllrb.com
[github]: https://github.com/Japhon
